tutorials/transport/multiSpeciesTransportFoam/Ketton/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   left 
    {
        type            fixedValue;
        value           uniform 1e-3;
    }

   right 
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(front|back|top|bottom)" 
    {
        type            zeroGradient;
    }


   solidwalls
   {
        type            zeroGradient;
   }


}


// ************************************************************************* //
