tutorials/transport/multiSpeciesTransportFoam/Ketton/0_orig/Cl-
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Cl-;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
solidwalls
    {
        type            zeroGradient;
    }

    "(front|back|top|bottom)"
    {
        type            zeroGradient;
    }

    left
    {
	type            fixedValue;
        value           uniform 1;
    }
    right 
    {
	type            zeroGradient;
    }
}


// ************************************************************************* //
